In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [18]:
df['Cabin']

0       NaN
1       C85
2       NaN
3      C123
4       NaN
       ...
886     NaN
887     B42
888     NaN
889    C148
890     NaN
Name: Cabin, Length: 891, dtype: object

In [19]:
df['Cabin'].isnull().sum()

687

In [21]:
df['Cabin_null'] = np.where(df['Cabin'].isnull(), 1, 0)

In [29]:
df['Cabin_null'].mean()

0.7710437710437711

In [30]:
df.shape

(891, 13)

In [34]:
df.groupby(['Survived'])['Cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: Cabin_null, dtype: float64

In [35]:
# Median imputation
df = pd.read_csv("train.csv", usecols= ['Survived', 'Fare', 'Age'])

In [36]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [39]:
df.isnull().sum()
df.shape

(891, 3)

In [38]:
df.Age.isnull().mean()

0.19865319865319866

In [57]:
df.Age.mode()

0    24.0
Name: Age, dtype: float64

In [50]:
from statistics import mean


def imputer(df, feature, mode):
    df[feature + "_mode_imputation"] = df['Age'].fillna(mode)

In [62]:
mode = df.Age.mode()

In [63]:
imputer(df, 'Age', mode)

In [65]:
df

     Survived   Age     Fare  Age_median_imputation  Age_mean_imputation
0           0  22.0   7.2500                   22.0                 22.0
1           1  38.0  71.2833                   38.0                 38.0
2           1  26.0   7.9250                   26.0                 26.0
3           1  35.0  53.1000                   35.0                 35.0
4           0  35.0   8.0500                   35.0                 35.0
..        ...   ...      ...                    ...                  ...
886         0  27.0  13.0000                   27.0                 27.0
887         1  19.0  30.0000                   19.0                 19.0
888         0   NaN  23.4500                   28.0                  NaN
889         1  26.0  30.0000                   26.0                 26.0
890         0  32.0   7.7500                   32.0                 32.0

[891 rows x 5 columns]